linkedin-connector-test/src/test/resources/artifacts/ESB/config/soapRequests/linkedin/companyLookUp.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.linkedin.companylookup">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:id>162479</urn:id>
      <urn:universalName/>
      <urn:accessToken>AQVsl150MFb2lXzYeS41EXBNQmhD6wk1tUwBLbFhNoiMr5-vDpdPVqTNDnZegLK5_iy0BGEldQh4kD-WRf1UW0DC1RXl2V3qjMYRTql_Vn83vU2Y3hg-uDvvlMdFSQ_Aq7FeMFY_d9KQd4s8PGh-wcLNMI8F36MEHXdZyzKmt92uZLIwuhA</urn:accessToken>
      <urn:emailDomains/>
      <urn:appUri>http://api.linkedin.com/v1</urn:appUri>
   </soapenv:Body>
</soapenv:Envelope>
